Revit 2024 API
AnalysisDisplayStyle.SetColorSettings Method
 Set color settings object for the style.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public void SetColorSettings(
	AnalysisDisplayColorSettings colorSettings
)
Visual Basic
Public Sub SetColorSettings ( _
	colorSettings As AnalysisDisplayColorSettings _
)
Visual C++
public:
void SetColorSettings(
	AnalysisDisplayColorSettings^ colorSettings
)
Parameters
colorSettings
Type: Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentsInconsistentException |  for Diagram display style, colorSettings must have type SolidColorRanges and exactly one intermediate entry with zero value
See Also
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace